 // จงเขียนโปรแกรมรับตัวเลข 1 ตัวแล้วให้คอมพิวเตอร์วาดรูปเครื่องหมาย * เป็นสี่เหลี่ยมที่มีด้านเท่ากับตัวเลขที่รับเข้ามาโดยมีพื้นที่เป็นตารางหมากรุก (Level 2)
#include<iostream>
int main()
{
	int a,i,j;
	scanf_s("%d", &a);

	for (i = 1; i <= a; i++)
	{
		for (j = 1; j <= a; j++)
		{
			if (j % 2 == 1 && i%2==1)
			{
				printf("*");
			}
			else if (j % 2 == 0 && i % 2 == 1)
			{
				printf(" ");
			}

			if (j % 2 == 0 && i % 2 == 0)
			{
				printf("*");
			}
			else if (j % 2 == 1 && i % 2 == 0)
			{
				printf(" ");
			}
		}
		printf("\n");
	}



	return 0;
}
